In [98]:
import pandas as pd

# Series

In [99]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [100]:
index_s = ['a', 'b', 'c', 'd', 'e']
ser = pd.Series([1, 2, 3, 4, 5], index=index_s)  # 데이터와 인덱스의 길이가 다르면 안됨
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [101]:
ser[0], ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_10124\1772165095.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['a']

(np.int64(1), np.int64(1))

In [102]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
ser1 = pd.Series(dict_data)
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [103]:
ser2 = pd.Series([10, 'banana'])
type(ser2), ser2  # dtype: object  -> 더 큰 자료형 기준

(pandas.core.series.Series,
 0        10
 1    banana
 dtype: object)

In [104]:
population = pd.Series([9776, 2729, 1566, 3158], index=['서울', '부산', '인천', '대구'])
population

서울    9776
부산    2729
인천    1566
대구    3158
dtype: int64

In [105]:
print(population['서울'])
print(population[['서울', '부산']])  # 0, 1  팬시 인덱싱

9776
서울    9776
부산    2729
dtype: int64

In [106]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [107]:
# 숫자 인덱스를 활용하여 호출힐 때 iloc 사용!
ser.iloc[0]

np.int64(1)

In [108]:
# 인덱스 이름으로 직접 호출힐 때 iloc 사용!
ser.loc['a']

np.int64(1)

`iloc[]` : indexlocator    
`loc[]` : locator

# DataFrame

In [109]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [110]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [111]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [112]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [113]:
scientists['Age']

0    37
1    61
Name: Age, dtype: int64

In [114]:
scientists.index = ['Rosaline Franklin', 'William Gosset']
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [115]:
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [116]:
scientists.iloc[1]

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [117]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)

df = pd.DataFrame(data, columns=['A', 'B', 'C'])  # 열 이름 지정
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [118]:
import numpy as np

# 넘파이 어레이로 데이터프레임 생성
arr = np.arange(1, 10).reshape(3, 3)
df = pd.DataFrame(arr, columns=['A', 'B', 'C'])
print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [119]:
# 시리즈로 데이터프레임 생성
names = pd.Series(['김사과', '이바나', '박포도'])
ages = pd.Series([25, 28, 22])
scores = pd.Series([85, 92, 77])

df = pd.DataFrame({
    '이름': names,
    '나이': ages,
    '점수': scores
})

df.index = [1, 2, 3]
df.index.name = '번호'
print(df)

     이름  나이  점수
번호
1   김사과  25  85
2   이바나  28  92
3   박포도  22  77

In [120]:
# 이건 왜 안되징..........
df = pd.DataFrame({
    '이름': names,
    '나이': ages,
    '점수': scores
}, index = [1, 2, 3])

df

    이름    나이    점수
1  이바나  28.0  92.0
2  박포도  22.0  77.0
3  NaN   NaN   NaN

names, ages, scores는 전부 인덱스 [0, 1, 2]임

그런데 DataFrame은 index=[1, 2, 3]이라고 지정했어

그러면 판다스는 각 Series에서 "1, 2, 3 인덱스를 찾으려고 함"

0 인덱스에 있는 값은 누락되고 3은 Series에 없으니까 NaN

In [121]:
df = pd.DataFrame({
    '이름': ['김사과', '이바나', '박포도'],
    '나이': [25, 28, 22],
    '점수': [85, 92, 77]
}, index = [1, 2, 3])

df

    이름  나이  점수
1  김사과  25  85
2  이바나  28  92
3  박포도  22  77

# 인덱싱과 슬라이싱

In [122]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [123]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [124]:
# [행, 열] 인덱싱
sci1.loc[0, 'Occupation']

'Chemist'

In [125]:
# [시작행:끝행, 시작열:끝열]   쉼표는 행과 열 -> 차원을 구분
sci1.iloc[:, 0:2]

                Name    Occupation
0  Rosaline Franklin       Chemist
1     William Gosset  Statistician

In [126]:
sci1.loc[0, 'Name']  # [row, col] 인덱싱

'Rosaline Franklin'

In [127]:
# iloc으로 추출
sci1.iloc[0,0]

'Rosaline Franklin'

In [128]:
# born, died만 추출
sci1[['Born', 'Died']]
sci1.iloc[:, 2:4]

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [129]:
sci1.to_csv('./data/scientist_1.csv')

In [130]:
# 인덱스는 빼고 저장 <- 더 편리함
sci1.to_csv('./data/scientist_2.csv', index=False)

In [131]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [132]:
# pickle: 파이썬의 객체형을 저장 (캡슐화)
sci1.to_pickle('./data/scientist.pickle')

In [133]:
df2 = pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [134]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

# 데이터 미리보기
1. info()
2. head() 와 tail() -> default 5개

In [135]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [136]:
df1.head(3)

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [137]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [138]:
df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [139]:
df1['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [140]:
df1.loc[:, 'Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

# 행 열 변경

In [141]:
data = {
    '이름': ['김사과', '이딸기', '박포도', '정바나', '최모과', '한수박', '윤낑깡'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김사과  25  85
1  이딸기  28  92
2  박포도  22  78
3  정바나  31  95
4  최모과  27  88
5  한수박  24  73
6  윤낑깡  29  91

In [142]:
df.shape

(7, 3)

In [143]:
df.values

array([['김사과', 25, 85],
       ['이딸기', 28, 92],
       ['박포도', 22, 78],
       ['정바나', 31, 95],
       ['최모과', 27, 88],
       ['한수박', 24, 73],
       ['윤낑깡', 29, 91]], dtype=object)

In [144]:
# 행 이름 변경
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
print(df.index)

# 모든 열 이름 한번에 변경 (길이가 같아야함)
df.columns = ['name', 'age', 'score']
print(df.columns)

df

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')
Index(['name', 'age', 'score'], dtype='object')

  name  age  score
A  김사과   25     85
B  이딸기   28     92
C  박포도   22     78
D  정바나   31     95
E  최모과   27     88
F  한수박   24     73
G  윤낑깡   29     91

In [145]:
# rename() 메서드 : 일부 열과 행의 이름을 변경
df.rename(columns={'name':'Name', 'age':'Age'})  # 원본은 바뀌지 않음

  Name  Age  score
A  김사과   25     85
B  이딸기   28     92
C  박포도   22     78
D  정바나   31     95
E  최모과   27     88
F  한수박   24     73
G  윤낑깡   29     91

In [146]:
# 일부 행 이름 소문자로 변경
# df.rename(index={'A':'a', 'E':'e'}, inplace=True)  # inplace=True 하면 원본 변경

# 위 방법 보다는 변수에 할당하는 방법 권장!
df1 = df.rename(index={'A':'a', 'E':'e'})
df1

  name  age  score
a  김사과   25     85
B  이딸기   28     92
C  박포도   22     78
D  정바나   31     95
e  최모과   27     88
F  한수박   24     73
G  윤낑깡   29     91

# 행 열 추가

In [147]:
df.iloc[0]  # 행단위 인덱싱

name     김사과
age       25
score     85
Name: A, dtype: object

In [148]:
df.iloc[0:2]  # 행단위 슬라이싱

  name  age  score
A  김사과   25     85
B  이딸기   28     92

In [149]:
df.loc['A']  # 행단위는 iloc, 이름단위 loc

name     김사과
age       25
score     85
Name: A, dtype: object

In [150]:
df[df['age'] > 25]  # 조건을 사용한 행 추출

  name  age  score
B  이딸기   28     92
D  정바나   31     95
E  최모과   27     88
G  윤낑깡   29     91

In [151]:
df[df['score'] >= 90]

  name  age  score
B  이딸기   28     92
D  정바나   31     95
G  윤낑깡   29     91

In [152]:
# 새로운 행 추가 -> loc[]를 이용
df.loc[7] = ['홍길동', 30, 70]
df

  name  age  score
A  김사과   25     85
B  이딸기   28     92
C  박포도   22     78
D  정바나   31     95
E  최모과   27     88
F  한수박   24     73
G  윤낑깡   29     91
7  홍길동   30     70

In [153]:
# iloc는 추가가 불가능
# df.iloc[8] = ['김길동', 20, 99]

In [154]:
# 열 추가
df['grade'] = ['B', 'A', 'C', 'A', 'B', 'C', 'A', 'C']
df

  name  age  score grade
A  김사과   25     85     B
B  이딸기   28     92     A
C  박포도   22     78     C
D  정바나   31     95     A
E  최모과   27     88     B
F  한수박   24     73     C
G  윤낑깡   29     91     A
7  홍길동   30     70     C

In [155]:
# 등급으로 열이름 변경
df2 = df.rename(columns={'grade':'등급'})
df2

  name  age  score 등급
A  김사과   25     85  B
B  이딸기   28     92  A
C  박포도   22     78  C
D  정바나   31     95  A
E  최모과   27     88  B
F  한수박   24     73  C
G  윤낑깡   29     91  A
7  홍길동   30     70  C

In [156]:
df.insert(loc=1, column='s_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008'])
df

  name  s_id  age  score grade
A  김사과  S001   25     85     B
B  이딸기  S002   28     92     A
C  박포도  S003   22     78     C
D  정바나  S004   31     95     A
E  최모과  S005   27     88     B
F  한수박  S006   24     73     C
G  윤낑깡  S007   29     91     A
7  홍길동  S008   30     70     C

In [161]:
# 인덱스로 행 삭제
df1 = df.drop(7, axis=0)
df = df1

In [162]:
df

  name  s_id  age  score grade
A  김사과  S001   25     85     B
B  이딸기  S002   28     92     A
C  박포도  S003   22     78     C
D  정바나  S004   31     95     A
E  최모과  S005   27     88     B
F  한수박  S006   24     73     C
G  윤낑깡  S007   29     91     A

In [163]:
# 열 삭제
df.drop('grade', axis=1)

  name  s_id  age  score
A  김사과  S001   25     85
B  이딸기  S002   28     92
C  박포도  S003   22     78
D  정바나  S004   31     95
E  최모과  S005   27     88
F  한수박  S006   24     73
G  윤낑깡  S007   29     91

In [164]:
df.drop(columns=df.columns[2])

  name  s_id  score grade
A  김사과  S001     85     B
B  이딸기  S002     92     A
C  박포도  S003     78     C
D  정바나  S004     95     A
E  최모과  S005     88     B
F  한수박  S006     73     C
G  윤낑깡  S007     91     A

In [165]:
# 만약 같은 컬럼이 두개라면? (ex. [4], [5])
# col_keep = [i for i in range(len(df.columns)) if i != 4]
# df = df.iloc[:, col_keep]
# df

In [167]:
df.columns[2]

'age'

In [168]:
# 데이터 형변환
df.astype({'s_id':str, 'score':float})

  name  s_id  age  score grade
A  김사과  S001   25   85.0     B
B  이딸기  S002   28   92.0     A
C  박포도  S003   22   78.0     C
D  정바나  S004   31   95.0     A
E  최모과  S005   27   88.0     B
F  한수박  S006   24   73.0     C
G  윤낑깡  S007   29   91.0     A

In [169]:
df['age'].astype(int)

A    25
B    28
C    22
D    31
E    27
F    24
G    29
Name: age, dtype: int64

In [170]:
df

  name  s_id  age  score grade
A  김사과  S001   25     85     B
B  이딸기  S002   28     92     A
C  박포도  S003   22     78     C
D  정바나  S004   31     95     A
E  최모과  S005   27     88     B
F  한수박  S006   24     73     C
G  윤낑깡  S007   29     91     A

In [ ]:
df.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')

In [173]:
df_new = df.set_index('s_id')
df_new

     name  age  score grade
s_id
S001  김사과   25     85     B
S002  이딸기   28     92     A
S003  박포도   22     78     C
S004  정바나   31     95     A
S005  최모과   27     88     B
S006  한수박   24     73     C
S007  윤낑깡   29     91     A

In [174]:
df_new.index

Index(['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007'], dtype='object', name='s_id')

In [175]:
df_new.reset_index(inplace=True)
df_new

   s_id name  age  score grade
0  S001  김사과   25     85     B
1  S002  이딸기   28     92     A
2  S003  박포도   22     78     C
3  S004  정바나   31     95     A
4  S005  최모과   27     88     B
5  S006  한수박   24     73     C
6  S007  윤낑깡   29     91     A

In [181]:
dr = pd.date_range('2025-06-01',periods=7, freq='MS')
dr

DatetimeIndex(['2025-06-01', '2025-07-01', '2025-08-01', '2025-09-01',
               '2025-10-01', '2025-11-01', '2025-12-01'],
              dtype='datetime64[ns]', freq='MS')

In [182]:
df_new['date'] = dr
df_new

   s_id name  age  score grade       date
0  S001  김사과   25     85     B 2025-06-01
1  S002  이딸기   28     92     A 2025-07-01
2  S003  박포도   22     78     C 2025-08-01
3  S004  정바나   31     95     A 2025-09-01
4  S005  최모과   27     88     B 2025-10-01
5  S006  한수박   24     73     C 2025-11-01
6  S007  윤낑깡   29     91     A 2025-12-01

In [183]:
df_new1 = df_new.set_index('date')
df_new1

            s_id name  age  score grade
date
2025-06-01  S001  김사과   25     85     B
2025-07-01  S002  이딸기   28     92     A
2025-08-01  S003  박포도   22     78     C
2025-09-01  S004  정바나   31     95     A
2025-10-01  S005  최모과   27     88     B
2025-11-01  S006  한수박   24     73     C
2025-12-01  S007  윤낑깡   29     91     A

In [185]:
df_new1.loc['2025-09-01']

s_id     S004
name      정바나
age        31
score      95
grade       A
Name: 2025-09-01 00:00:00, dtype: object